[Killed] ArrayDeclaration
taller8/robobar-example/src/app.module.js:1:39
-const app = angular.module('robobar', ['ngRoute']);
+const app = angular.module('robobar', []);
 app.value('localStorage', window.localStorage);
