[Killed] BlockStatement
robobar-example/src/place-order-component/place-order-component.js:4:60
 (() => {
     class PlaceOrderComponent {
 
-        constructor(orderService, drinkService, $location) {
-            this.drinks = drinkService.getDrinks();
-            this.orderService = orderService;
-            this.$location = $location;
-        }
+        constructor(orderService, drinkService, $location) {}
 
         increment(drink) {

[Killed] BlockStatement
robobar-example/src/place-order-component/place-order-component.js:10:26
             this.$location = $location;
         }
 
-        increment(drink) {
-            drink.amount++;
-        }
+        increment(drink) {}
         decrement(drink) {
             drink.amount--;

[Killed] UpdateOperator
robobar-example/src/place-order-component/place-order-component.js:11:13
         }
 
         increment(drink) {
-            drink.amount++;
+            drink.amount--;
         }
         decrement(drink) {

[Killed] BlockStatement
robobar-example/src/place-order-component/place-order-component.js:13:26
         increment(drink) {
             drink.amount++;
         }
-        decrement(drink) {
-            drink.amount--;
-            if (drink.amount < 0) {
-                drink.amount = 0;
-            }
-        }
+        decrement(drink) {}
 
         totalPrice() {

[Killed] UpdateOperator
robobar-example/src/place-order-component/place-order-component.js:14:13
             drink.amount++;
         }
         decrement(drink) {
-            drink.amount--;
+            drink.amount++;
             if (drink.amount < 0) {
                 drink.amount = 0;

[Killed] ConditionalExpression
robobar-example/src/place-order-component/place-order-component.js:15:17
         }
         decrement(drink) {
             drink.amount--;
-            if (drink.amount < 0) {
+            if (false) {
                 drink.amount = 0;
             }

[Killed] ConditionalExpression
robobar-example/src/place-order-component/place-order-component.js:15:17
         }
         decrement(drink) {
             drink.amount--;
-            if (drink.amount < 0) {
+            if (true) {
                 drink.amount = 0;
             }

[Killed] BlockStatement
robobar-example/src/place-order-component/place-order-component.js:20:22
             }
         }
 
-        totalPrice() {
-            return this.drinks.reduce((total, drink) => total + drink.amount * drink.price, 0);
-        }
+        totalPrice() {}
 
         submitEnabled() {

[Killed] ArithmeticOperator
robobar-example/src/place-order-component/place-order-component.js:21:65
         }
 
         totalPrice() {
-            return this.drinks.reduce((total, drink) => total + drink.amount * drink.price, 0);
+            return this.drinks.reduce((total, drink) => total + drink.amount / drink.price, 0);
         }
 

[Killed] ArrowFunction
robobar-example/src/place-order-component/place-order-component.js:21:39
         }
 
         totalPrice() {
-            return this.drinks.reduce((total, drink) => total + drink.amount * drink.price, 0);
+            return this.drinks.reduce(() => undefined, 0);
         }
 

[Survived] BlockStatement
robobar-example/src/place-order-component/place-order-component.js:24:25
             return this.drinks.reduce((total, drink) => total + drink.amount * drink.price, 0);
         }
 
-        submitEnabled() {
-            return this.drinks.some(drink => drink.amount > 0);
-        }
+        submitEnabled() {}
 
         submit() {

[Killed] ConditionalExpression
robobar-example/src/place-order-component/place-order-component.js:25:46
         }
 
         submitEnabled() {
-            return this.drinks.some(drink => drink.amount > 0);
+            return this.drinks.some(drink => true);
         }
 

[Killed] EqualityOperator
robobar-example/src/place-order-component/place-order-component.js:25:46
         }
 
         submitEnabled() {
-            return this.drinks.some(drink => drink.amount > 0);
+            return this.drinks.some(drink => drink.amount <= 0);
         }
 

[Killed] BlockStatement
robobar-example/src/place-order-component/place-order-component.js:28:18
             return this.drinks.some(drink => drink.amount > 0);
         }
 
-        submit() {
-            this.orderService.currentOrder = this.drinks.filter(drink => drink.amount);
-            this.$location.path('/review'); 
-        }
+        submit() {}
     }
 

[Survived] ArrowFunction
robobar-example/src/place-order-component/place-order-component.js:29:65
         }
 
         submit() {
-            this.orderService.currentOrder = this.drinks.filter(drink => drink.amount);
+            this.orderService.currentOrder = this.drinks.filter(() => undefined);
             this.$location.path('/review'); 
         }

[Killed] StringLiteral
robobar-example/src/place-order-component/place-order-component.js:34:68
         }
     }
 
-    PlaceOrderComponent.$inject = ['orderService', 'drinkService', '$location'];
+    PlaceOrderComponent.$inject = ['orderService', 'drinkService', ""];
 
     app.component('roboPlaceOrder', {

[Killed] ArrayDeclaration
robobar-example/src/place-order-component/place-order-component.js:34:35
         }
     }
 
-    PlaceOrderComponent.$inject = ['orderService', 'drinkService', '$location'];
+    PlaceOrderComponent.$inject = [];
 
     app.component('roboPlaceOrder', {

[Survived] StringLiteral
robobar-example/src/place-order-component/place-order-component.js:37:22
     PlaceOrderComponent.$inject = ['orderService', 'drinkService', '$location'];
 
     app.component('roboPlaceOrder', {
-        templateUrl: '/src/place-order-component/place-order-component.html',
+        templateUrl: "",
         controller: PlaceOrderComponent,
         controllerAs: 'cpt'
