[Killed] BlockStatement
robobar-example/src/review-order-component/review-order-component.js:3:46
 (() => {
     class ReviewOrderComponent {
-        constructor(orderService, $location) {
-            this.$location = $location;
-            this.orderService = orderService;
-            if (orderService.currentOrder) {
-                this.order = orderService.currentOrder;
-                this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);
-                this.ageCheck = this.order.some(drink => drink.isAlcoholic);
-            } else {
-                $location.path('/');
-            }
-        }
+        constructor(orderService, $location) {}
 
         submit() {

[Killed] ConditionalExpression
robobar-example/src/review-order-component/review-order-component.js:6:17
         constructor(orderService, $location) {
             this.$location = $location;
             this.orderService = orderService;
-            if (orderService.currentOrder) {
+            if (true) {
                 this.order = orderService.currentOrder;
                 this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);

[Killed] ConditionalExpression
robobar-example/src/review-order-component/review-order-component.js:6:17
         constructor(orderService, $location) {
             this.$location = $location;
             this.orderService = orderService;
-            if (orderService.currentOrder) {
+            if (false) {
                 this.order = orderService.currentOrder;
                 this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);

[Survived] ArithmeticOperator
robobar-example/src/review-order-component/review-order-component.js:8:84
             this.orderService = orderService;
             if (orderService.currentOrder) {
                 this.order = orderService.currentOrder;
-                this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);
+                this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks - drink.amount, 0);
                 this.ageCheck = this.order.some(drink => drink.isAlcoholic);
             } else {

[Survived] ArrowFunction
robobar-example/src/review-order-component/review-order-component.js:8:57
             this.orderService = orderService;
             if (orderService.currentOrder) {
                 this.order = orderService.currentOrder;
-                this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);
+                this.numberOfDrinks = this.order.reduce(() => undefined, 0);
                 this.ageCheck = this.order.some(drink => drink.isAlcoholic);
             } else {

[Survived] ArrowFunction
robobar-example/src/review-order-component/review-order-component.js:9:49
             if (orderService.currentOrder) {
                 this.order = orderService.currentOrder;
                 this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);
-                this.ageCheck = this.order.some(drink => drink.isAlcoholic);
+                this.ageCheck = this.order.some(() => undefined);
             } else {
                 $location.path('/');

[Killed] BlockStatement
robobar-example/src/review-order-component/review-order-component.js:10:20
                 this.order = orderService.currentOrder;
                 this.numberOfDrinks = this.order.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0);
                 this.ageCheck = this.order.some(drink => drink.isAlcoholic);
-            } else {
-                $location.path('/');
-            }
+            } else {}
         }
 

[Killed] BlockStatement
robobar-example/src/review-order-component/review-order-component.js:15:18
             }
         }
 
-        submit() {
-            if (!this.ageCheck || this.isAllowedToBuyAlcohol({ age: this.age })) {
-                this.error = null;
-                this.$location.path('/success');
-            } else {
-                this.error = 'Only adults can buy alcohol!';
-            }
-        }
+        submit() {}
 
         cancel() {

[Killed] BooleanLiteral
robobar-example/src/review-order-component/review-order-component.js:16:17
         }
 
         submit() {
-            if (!this.ageCheck || this.isAllowedToBuyAlcohol({ age: this.age })) {
+            if (this.ageCheck || this.isAllowedToBuyAlcohol({ age: this.age })) {
                 this.error = null;
                 this.$location.path('/success');

[Killed] ConditionalExpression
robobar-example/src/review-order-component/review-order-component.js:16:17
         }
 
         submit() {
-            if (!this.ageCheck || this.isAllowedToBuyAlcohol({ age: this.age })) {
+            if (false) {
                 this.error = null;
                 this.$location.path('/success');

[Survived] StringLiteral
robobar-example/src/review-order-component/review-order-component.js:18:37
         submit() {
             if (!this.ageCheck || this.isAllowedToBuyAlcohol({ age: this.age })) {
                 this.error = null;
-                this.$location.path('/success');
+                this.$location.path("");
             } else {
                 this.error = 'Only adults can buy alcohol!';

[Killed] BlockStatement
robobar-example/src/review-order-component/review-order-component.js:19:20
             if (!this.ageCheck || this.isAllowedToBuyAlcohol({ age: this.age })) {
                 this.error = null;
                 this.$location.path('/success');
-            } else {
-                this.error = 'Only adults can buy alcohol!';
-            }
+            } else {}
         }
 

[Killed] StringLiteral
robobar-example/src/review-order-component/review-order-component.js:20:30
                 this.error = null;
                 this.$location.path('/success');
             } else {
-                this.error = 'Only adults can buy alcohol!';
+                this.error = "";
             }
         }

[Killed] BlockStatement
robobar-example/src/review-order-component/review-order-component.js:24:18
             }
         }
 
-        cancel() {
-            this.orderService.clear();
-            this.$location.path('/');
-        }
+        cancel() {}
 
         isAllowedToBuyAlcohol(customer) {

[Killed] BlockStatement
robobar-example/src/review-order-component/review-order-component.js:29:41
             this.$location.path('/');
         }
 
-        isAllowedToBuyAlcohol(customer) {
-            return customer.age > 18;
-        }
+        isAllowedToBuyAlcohol(customer) {}
     }
 

[Killed] ConditionalExpression
robobar-example/src/review-order-component/review-order-component.js:30:20
         }
 
         isAllowedToBuyAlcohol(customer) {
-            return customer.age > 18;
+            return false;
         }
     }

[Killed] ConditionalExpression
robobar-example/src/review-order-component/review-order-component.js:30:20
         }
 
         isAllowedToBuyAlcohol(customer) {
-            return customer.age > 18;
+            return true;
         }
     }

[Killed] StringLiteral
robobar-example/src/review-order-component/review-order-component.js:35:19
     }
 
     ReviewOrderComponent.$inject = ['orderService', '$location'];
-    app.component('roboReviewOrder', {
+    app.component("", {
         controller: ReviewOrderComponent,
         templateUrl: '/src/review-order-component/review-order-component.html',
