[Survived] BlockStatement
robobar-example/src/robobar-component/robobar-component.js:1:8
-(() => {
-    class RobobarComponent {
-    }
-
-    app.component('roboRobobar', {
-        templateUrl: '/src/robobar-component/robobar-component.html',
-        controller: RobobarComponent
-    });
-})();
+(() => {})();

[Killed] StringLiteral
robobar-example/src/robobar-component/robobar-component.js:5:19
     class RobobarComponent {
     }
 
-    app.component('roboRobobar', {
+    app.component("", {
         templateUrl: '/src/robobar-component/robobar-component.html',
         controller: RobobarComponent

[Survived] ObjectLiteral
robobar-example/src/robobar-component/robobar-component.js:5:34
     class RobobarComponent {
     }
 
-    app.component('roboRobobar', {
-        templateUrl: '/src/robobar-component/robobar-component.html',
-        controller: RobobarComponent
-    });
+    app.component('roboRobobar', {});
 })();
