[Survived] BlockStatement
taller8/robobar-example/src/routes.js:1:8
-(() => {
-    app.config(($routeProvider) => {
-        $routeProvider
-            .when('/', {
-                template: '<robo-place-order></robo-place-order>'
-            })
-            .when('/review', {
-                template: '<robo-review-order></robo-review-order>'
-            })
-            .when('/success', {
-                template: '<robo-success></robo-success>'
-            })
-            .otherwise({
-                redirectTo: '/'
-            });
-    });
-})();
+(() => {})();

[Survived] BlockStatement
taller8/robobar-example/src/routes.js:2:36
 (() => {
-    app.config(($routeProvider) => {
-        $routeProvider
-            .when('/', {
-                template: '<robo-place-order></robo-place-order>'
-            })
-            .when('/review', {
-                template: '<robo-review-order></robo-review-order>'
-            })
-            .when('/success', {
-                template: '<robo-success></robo-success>'
-            })
-            .otherwise({
-                redirectTo: '/'
-            });
-    });
+    app.config(($routeProvider) => {});
 })();

[Survived] StringLiteral
taller8/robobar-example/src/routes.js:4:19
 (() => {
     app.config(($routeProvider) => {
         $routeProvider
-            .when('/', {
+            .when("", {
                 template: '<robo-place-order></robo-place-order>'
             })

[Survived] ObjectLiteral
taller8/robobar-example/src/routes.js:13:24
             .when('/success', {
                 template: '<robo-success></robo-success>'
             })
-            .otherwise({
-                redirectTo: '/'
-            });
+            .otherwise({});
     });
 })();
