[Killed] BlockStatement
robobar-example/src/services/DrinkService.js:1:8
-(() => {
-    class DrinkService {
-        getDrinks() {
-            return [
-                { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-                { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: true },
-                { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: true }
-            ];
-        }
-    }
-
-    app.service('drinkService', DrinkService);
-})();
+(() => {})();

[Killed] BlockStatement
robobar-example/src/services/DrinkService.js:3:21
 (() => {
     class DrinkService {
-        getDrinks() {
-            return [
-                { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-                { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: true },
-                { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: true }
-            ];
-        }
+        getDrinks() {}
     }
 

[Survived] ObjectLiteral
robobar-example/src/services/DrinkService.js:5:17
     class DrinkService {
         getDrinks() {
             return [
-                { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
+                {},
                 { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: true },
                 { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: true }

[Survived] BooleanLiteral
robobar-example/src/services/DrinkService.js:6:75
         getDrinks() {
             return [
                 { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
-                { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: true },
+                { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: false },
                 { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: true }
             ];

[Survived] BooleanLiteral
robobar-example/src/services/DrinkService.js:7:75
             return [
                 { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
                 { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: true },
-                { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: true }
+                { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: false }
             ];
         }

[Killed] ObjectLiteral
robobar-example/src/services/DrinkService.js:7:17
             return [
                 { name: 'Roba Cola', price: 1.25, amount: 0, isAlcoholic: false },
                 { name: 'Robo Beer', price: 2.00, amount: 0, isAlcoholic: true },
-                { name: 'Rob(w)ine', price: 3.00, amount: 0, isAlcoholic: true }
+                {}
             ];
         }
