[Killed] BlockStatement
robobar-example/src/services/OrderService.js:4:35
 (() => {
     class OrderService {
 
-        constructor(localStorage) {
-            this.localStorage = localStorage;
-        }
+        constructor(localStorage) {}
 
         get currentOrder() {

[Killed] BlockStatement
robobar-example/src/services/OrderService.js:8:28
             this.localStorage = localStorage;
         }
 
-        get currentOrder() {
-            if (!this._currentOrder && this.localStorage['currentOrder']) {
-                this._currentOrder = JSON.parse(this.localStorage['currentOrder'])
-            }
-            return this._currentOrder;
-        }
+        get currentOrder() {}
 
         set currentOrder(value) {

[Killed] BlockStatement
robobar-example/src/services/OrderService.js:9:75
         }
 
         get currentOrder() {
-            if (!this._currentOrder && this.localStorage['currentOrder']) {
-                this._currentOrder = JSON.parse(this.localStorage['currentOrder'])
-            }
+            if (!this._currentOrder && this.localStorage['currentOrder']) {}
             return this._currentOrder;
         }

[Killed] BooleanLiteral
robobar-example/src/services/OrderService.js:9:17
         }
 
         get currentOrder() {
-            if (!this._currentOrder && this.localStorage['currentOrder']) {
+            if (this._currentOrder && this.localStorage['currentOrder']) {
                 this._currentOrder = JSON.parse(this.localStorage['currentOrder'])
             }

[Killed] StringLiteral
robobar-example/src/services/OrderService.js:10:67
 
         get currentOrder() {
             if (!this._currentOrder && this.localStorage['currentOrder']) {
-                this._currentOrder = JSON.parse(this.localStorage['currentOrder'])
+                this._currentOrder = JSON.parse(this.localStorage[""])
             }
             return this._currentOrder;

[Survived] BlockStatement
robobar-example/src/services/OrderService.js:15:33
             return this._currentOrder;
         }
 
-        set currentOrder(value) {
-            this._currentOrder = value;
-            this.localStorage['currentOrder'] = JSON.stringify(value);
-        }
+        set currentOrder(value) {}
 
         clear() {

[Survived] BlockStatement
robobar-example/src/services/OrderService.js:20:17
             this.localStorage['currentOrder'] = JSON.stringify(value);
         }
 
-        clear() {
-            this.currentOrder = null;
-        }
+        clear() {}
     }
 
