[Killed] BlockStatement
robobar-example/src/success-component/success-component.js:1:8
-(() => {
-
-    class SuccessComponent {
-
-        constructor(orderService) {
-            this.numberOfDrinks = orderService.currentOrder.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0)
-        }
-    }
-
-    SuccessComponent.$inject = ['orderService'];
-
-    app.component('roboSuccess', {
-        templateUrl: '/src/success-component/success-component.html',
-        controller: SuccessComponent,
-        controllerAs: 'cpt'
-    });
-})();
+(() => {})();

[Survived] BlockStatement
robobar-example/src/success-component/success-component.js:5:35
 
     class SuccessComponent {
 
-        constructor(orderService) {
-            this.numberOfDrinks = orderService.currentOrder.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0)
-        }
+        constructor(orderService) {}
     }
 

[Survived] ArrowFunction
robobar-example/src/success-component/success-component.js:6:68
     class SuccessComponent {
 
         constructor(orderService) {
-            this.numberOfDrinks = orderService.currentOrder.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0)
+            this.numberOfDrinks = orderService.currentOrder.reduce(() => undefined, 0)
         }
     }

[Survived] ArithmeticOperator
robobar-example/src/success-component/success-component.js:6:95
     class SuccessComponent {
 
         constructor(orderService) {
-            this.numberOfDrinks = orderService.currentOrder.reduce((numberOfDrinks, drink) => numberOfDrinks + drink.amount, 0)
+            this.numberOfDrinks = orderService.currentOrder.reduce((numberOfDrinks, drink) => numberOfDrinks - drink.amount, 0)
         }
     }

[Survived] ObjectLiteral
robobar-example/src/success-component/success-component.js:12:34
 
     SuccessComponent.$inject = ['orderService'];
 
-    app.component('roboSuccess', {
-        templateUrl: '/src/success-component/success-component.html',
-        controller: SuccessComponent,
-        controllerAs: 'cpt'
-    });
+    app.component('roboSuccess', {});
 })();

[Survived] StringLiteral
robobar-example/src/success-component/success-component.js:15:23
     app.component('roboSuccess', {
         templateUrl: '/src/success-component/success-component.html',
         controller: SuccessComponent,
-        controllerAs: 'cpt'
+        controllerAs: ""
     });
 })();
